In [1]:
import pandas as pd

In [2]:
data_class = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
    'name': ['8 A', '8 B', '9 C', '9 B', '9 A', '10 B', '10 A', 
             '11 B', '11 A', '7 A', '7 B', '6 A', '6 B', '5 A', 
             '5 B', '4 A']
}
data_schedule = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
           21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44],
    'date': ['2019-09-01T00:00:00.000Z', '2019-09-01T00:00:00.000Z', '2019-09-01T00:00:00.000Z', '2019-09-02T00:00:00.000Z', 
             '2019-09-02T00:00:00.000Z', '2019-09-02T00:00:00.000Z', '2019-09-03T00:00:00.000Z', '2019-09-03T00:00:00.000Z', 
             '2019-09-03T00:00:00.000Z', '2019-09-04T00:00:00.000Z', '2019-09-04T00:00:00.000Z', '2019-09-04T00:00:00.000Z', 
             '2019-09-05T00:00:00.000Z', '2019-09-05T00:00:00.000Z', '2019-09-05T00:00:00.000Z', '2019-08-30T00:00:00.000Z', 
             '2019-08-30T00:00:00.000Z', '2019-08-30T00:00:00.000Z', '2019-08-30T00:00:00.000Z', '2019-09-03T00:00:00.000Z', 
             '2019-08-30T00:00:00.000Z', '2019-08-30T00:00:00.000Z', '2019-08-30T00:00:00.000Z', '2019-08-30T00:00:00.000Z', 
             '2019-08-30T00:00:00.000Z', '2019-09-01T00:00:00.000Z', '2019-09-01T00:00:00.000Z', '2019-09-01T00:00:00.000Z', 
             '2019-09-01T00:00:00.000Z', '2019-09-02T00:00:00.000Z', '2019-09-02T00:00:00.000Z', '2019-09-03T00:00:00.000Z', 
             '2019-09-03T00:00:00.000Z', '2019-09-03T00:00:00.000Z', '2019-09-04T00:00:00.000Z', '2019-09-04T00:00:00.000Z', 
             '2019-09-04T00:00:00.000Z', '2019-09-04T00:00:00.000Z', '2019-09-04T00:00:00.000Z', '2019-09-05T00:00:00.000Z', 
             '2019-09-03T00:00:00.000Z', '2019-09-03T00:00:00.000Z', '2019-09-03T00:00:00.000Z', '2019-09-02T00:00:00.000Z'],
    'class': [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 
              8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 7, 7, 7, 7],
    'number_pair': [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 4, 4, 
                    1, 2, 3, 4, 5, 2, 3, 4, 5, 3, 4, 1, 2, 3, 1, 2, 3, 4, 5, 2, 1, 2, 3, 2],
    'teacher': [11, 8, 4, 4, 2, 6, 5, 13, 6, 9, 10, 3, 3, 11, 5, 2, 8, 6, 10, 10, 
                7, 7, 8, 11, 8, 2, 6, 12, 13, 6, 7, 10, 7, 7, 1, 1, 3, 8, 11, 11, 8, 4, 15, 6],
    'subject': [1, 2, 3, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 1, 6, 4, 2, 5, 1, 10, 
                9, 9, 2, 1, 3, 4, 5, 6, 7, 8, 9, 10, 9, 9, 11, 12, 13, 2, 1, 1, 2, 3, 10, 5],
    'classroom': [47, 13, 13, 13, 34, 35, 36, 37, 38, 39, 40, 41, 43, 47, 36, 34, 13, 35, 47, 40, 
                  53, 53, 38, 43, 39, 34, 35, 36, 37, 38, 53, 40, 53, 53, 4, 42, 43, 42, 43, 43, 42, 13, 40, 35]
}
data_student = {
    'id': list(range(1, 86)),
    'first_name': [
        'Nikolaj', 'Vyacheslav', 'Ivan', 'Anatolij', 'Georgij', 'Artyom', 'Arina', 'Angelina', 'Ekaterina', 'Raisa',
        'Leonid', 'Snezhana', 'Semyon', 'Georgij', 'YUliya', 'Valentina', 'Leonid', 'Vladislav', 'Snezhana', 'Lyubov',
        'Anfisa', 'Anna', 'Kristina', 'Kristina', 'Boris', 'Dmitrij', 'YAkov', 'Fyodor', 'Gleb', 'Angelina',
        'Nina', 'Valeriya', 'Grigorij', 'Vitalij', 'Svyatoslav', 'Matvej', 'Ilya', 'Lyubov', 'Polina', 'Elizaveta',
        'YUliya', 'Matvej', 'Ilya', 'Denis', 'Svyatoslav', 'Anna', 'ZHanna', 'Valeriya', 'Valentina', 'Nataliya',
        'Viktoriya', 'Stanislav', 'Gennadij', 'Roman', 'Timur', 'Danila', 'Arina', 'Nadezhda', 'Larisa', 'Aleksandra',
        'Natalya', 'Mariya', 'YUrij', 'Kirill', 'Grigorij', 'Semyon', 'Vasilij', 'Valentina', 'Larisa', 'Galina',
        'Arina', 'Viktoriya', 'Vasilij', 'Timur', 'Gleb', 'Denis', 'Elizaveta', 'Vera', 'Margarita', 'Angelina',
        'Semyon', 'Innokentij', 'Artyom', 'Egor', 'Elizaveta'
    ],
    'middle_name': [
        'Fedorovich', 'Evgenevich', 'Antonovich', 'Valentinovich', 'Dmitrievich', 'Borisovich', 'Fyodorovna', 
        'Aleksandrovna', 'Alekseevna', 'Semyonovna', 'Nikitich', 'YAkovlevna', 'Vladislavovich', 'Vyacheslavovich', 
        'Rostislavovna', 'Andreevna', 'Romanovich', 'Sergeevich', 'Ivanovna', 'Maksimovna', 'Antonovna', 'Olegovna', 
        'Fyodorovna', 'Glebovna', 'Innokentevich', 'Leonidovich', 'Leonidovich', 'Rostislavovich', 'Antonovich', 
        'Aleksandrovna', 'Ilinichna', 'Olegovna', 'Gennadevich', 'Eduardovich', 'Vyacheslavovich', 'Vyacheslavovich', 
        'Stepanovich', 'Vyacheslavovna', 'Kirillovna', 'Fyodorovna', 'Daniilovna', 'Gennadevich', 'Egorovich', 
        'Nikitich', 'Valentinovich', 'Denisovna', 'Ilinichna', 'YUrevna', 'Andreevna', 'Igorevna', 'YAroslavovna', 
        None, 'Denisovich', 'Nikolaevich', 'Ilich', 'Ivanovich', 'Timofeevna', 'Ilinichna', 'Stanislavovna', 
        'Andreevna', 'Nikolaevna', 'Valerievna', 'Denisovich', None, 'Kirillovich', 'Semyonovich', 'Gennadevich', 
        'YAkovlevna', 'Timurovna', 'YAroslavovna', 'Ivanovna', 'YUrevna', 'Glebovich', 'Filippovich', 'Timofeevich', 
        'Matveevich', 'Borisovna', 'Lvovna', 'Vladislavovna', 'Danilovna', 'Anatolevich', 'Vyacheslavovich', 
        'Viktorovich', 'Petrovich', None
    ],
    'last_name': [
        'Sokolov', 'Eliseev', 'Efremov', 'ZHdanov', 'Noskov', 'Sergeev', 'Evseeva', 'Voroncova', 'Ustinova', 'Lapina',
        'Ignatov', 'Seliverstova', 'Biryukov', 'Baranov', 'Vishnyakova', 'Bolshakova', 'Kryukov', 'Cvetkov', 'Morozova', 
        'Borisova', 'Kalashnikova', 'Osipova', 'Myasnikova', 'Smirnova', 'Simonov', 'Trofimov', 'Rozhkov', 'Drozdov', 
        'Strelkov', 'Lukina', 'Odincova', 'Novikova', 'Kapustin', 'Panfilov', 'Tarasov', 'YAkushev', 'Alekseev', 
        'Zaharova', 'Sidorova', 'Samojlova', 'Avdeeva', 'Bogdanov', 'Filippov', 'Mel', 'Muravyov', 'Kulagina', 
        'Fokina', 'Lapina', 'Sazonova', 'Myasnikova', 'Makarova', 'Lazarev', 'Ovchinnikov', 'SHilov', 'Subbotin', 
        'Osipov', 'Silina', 'Zaharova', 'SHCHerbakova', 'Belozyorova', 'Davydova', 'Fadeeva', 'Markov', 'SHubin', 
        'Kolobov', 'Trofimov', 'Ustinov', 'SHarova', 'Savina', 'Orekhova', 'SHarapova', 'Sergeeva', 'Krasilnikov', 
        'Rusakov', 'Nesterov', 'Makarov', 'SHilova', 'Evseeva', 'Kabanova', 'Lazareva', 'Voronov', 'Nekrasov', 
        'Nikitin', 'Belyakov', 'Fadeeva'
    ],
    'birthday': [
        '2000-10-01T00:00:00.000Z', '2000-11-21T00:00:00.000Z', '2000-09-19T00:00:00.000Z', '2007-07-15T00:00:00.000Z',
        '2000-03-03T00:00:00.000Z', '2007-01-01T00:00:00.000Z', '2000-08-11T00:00:00.000Z', '2000-05-21T00:00:00.000Z',
        '2000-01-04T00:00:00.000Z', '2000-02-05T00:00:00.000Z', '2007-12-30T00:00:00.000Z', '2000-07-23T00:00:00.000Z',
        '2000-09-11T00:00:00.000Z', '2001-01-11T00:00:00.000Z', '2001-12-03T00:00:00.000Z', '2001-05-30T00:00:00.000Z',
        '2001-06-04T00:00:00.000Z', '2001-04-05T00:00:00.000Z', '2001-11-06T00:00:00.000Z', '2001-07-12T00:00:00.000Z',
        '2001-01-11T00:00:00.000Z', '2001-04-16T00:00:00.000Z', '2001-02-03T00:00:00.000Z', '2001-03-04T00:00:00.000Z',
        '2001-04-05T00:00:00.000Z', '2001-05-06T00:00:00.000Z', '2001-06-07T00:00:00.000Z', '2001-07-08T00:00:00.000Z',
        '2001-08-09T00:00:00.000Z', '2001-09-10T00:00:00.000Z', '2001-10-11T00:00:00.000Z', '2001-11-12T00:00:00.000Z',
        '2001-12-13T00:00:00.000Z', '2001-01-01T00:00:00.000Z', '2002-01-14T00:00:00.000Z', '2002-02-15T00:00:00.000Z',
        '2002-03-16T00:00:00.000Z', '2002-04-17T00:00:00.000Z', '2002-05-18T00:00:00.000Z', '2002-06-19T00:00:00.000Z',
        '2002-07-20T00:00:00.000Z', '2002-08-21T00:00:00.000Z', '2002-09-22T00:00:00.000Z', '2002-10-23T00:00:00.000Z',
        '2002-11-24T00:00:00.000Z', '2002-12-25T00:00:00.000Z', '2002-01-26T00:00:00.000Z', '2002-02-27T00:00:00.000Z',
        '2002-03-01T00:00:00.000Z', '2002-04-02T00:00:00.000Z', '2002-05-03T00:00:00.000Z', '2002-06-04T00:00:00.000Z',
        '2002-07-05T00:00:00.000Z', '2003-08-06T00:00:00.000Z', '2003-09-07T00:00:00.000Z', '2003-10-08T00:00:00.000Z',
        '2003-11-09T00:00:00.000Z', '2003-12-10T00:00:00.000Z', '2003-01-11T00:00:00.000Z', '2003-02-12T00:00:00.000Z',
        '2003-03-13T00:00:00.000Z', '2003-04-14T00:00:00.000Z', '2003-05-15T00:00:00.000Z', '2003-06-16T00:00:00.000Z',
        '2003-07-17T00:00:00.000Z', '2003-08-18T00:00:00.000Z', '2003-09-17T00:00:00.000Z', '2003-10-04T00:00:00.000Z',
        '2004-11-05T00:00:00.000Z', '2004-12-07T00:00:00.000Z', '2004-01-08T00:00:00.000Z', '2004-02-09T00:00:00.000Z',
        '2004-03-15T00:00:00.000Z', '2004-04-26T00:00:00.000Z', '2004-05-05T00:00:00.000Z', '2004-05-09T00:00:00.000Z',
        '2004-06-14T00:00:00.000Z', '2004-07-04T00:00:00.000Z', '2004-08-08T00:00:00.000Z', '2004-09-04T00:00:00.000Z',
        '2004-10-05T00:00:00.000Z', '2004-01-06T00:00:00.000Z', '2004-11-07T00:00:00.000Z', '2004-12-08T00:00:00.000Z',
        '2001-11-01T00:00:00.000Z'
    ],
    'address': [
        'ul. Pushkina, d. 36, kv. 5', 'ul. Pushkina, d. 40, kv. 7', 'ul. Pushkina, d. 58, kv. 16', 'ul. Pushkina, d. 21, kv. 7',
        'ul. Pushkina, d. 45, kv. 65', 'ul. Pushkina, d. 1, kv. 5', 'ul. Pushkina, d. 21, kv. 51', 'ul. Pervomajskaya, d. 121, kv. 5',
        'ul. Pervomajskaya, d. 45, kv. 2', 'ul. Pervomajskaya, d. 56, kv. 7', 'ul. Pushkina, d. 78, kv. 9', 'ul. Pushkina, d. 78, kv. 56',
        'ul. CHernova, d. 54, kv. 67', 'ul. CHernova, d. 56, kv. 89', 'ul. Kuratova, d. 96, kv. 45', 'ul. Pervomajskaya, d. 89, kv. 67',
        'ul. Zapadnaya, d. 78, kv. 9', 'ul. Karla Marksa, d. 89, kv. 7', 'ul. Internacionalnaya, d. 7, kv. 9', 'ul. Kirova, d. 23, kv. 13',
        'ul. Oplesnina, d. 4, kv. 4', 'ul. CHernova, d. 32, kv. 56', 'ul. YUzhnaya, d. 45, kv. 56', 'ul. Markova, d. 78, kv. 67',
        'ul. Kuratova, d. 89, kv. 78', 'ul. Pushkina, d. 78, kv. 9', 'ul. Karla Marksa, d. 45, kv. 7', 'ul. Pervomajskaya, d. 23, kv. 34',
        'ul. Zapadnaya, d. 23, kv. 13', 'ul. Internacionalnaya, d. 45, kv. 7', 'ul. Kuratova, d. 4, kv. 76', 'ul. Kirova, d. 3, kv. 56',
        'ul. Pervomajskaya, d. 45, kv. 6', 'ul. CHernova, d. 34, kv. 87', 'ul. Pushkina, d. 5, kv. 6', 'ul. Zapadnaya, d. 7, kv. 8',
        'ul. Pervomajskaya, d. 9, kv. 12', 'ul. CHernova, d. 12, kv. 13', 'ul. Kuratova, d. 13, kv. 14', 'ul. Karla Marksa, d. 46, kv. 45',
        'ul. Internacionalnaya, d. 87, kv. 78', 'ul. Pervomajskaya, d. 9, kv. 8', 'ul. CHernova, d. 100, kv. 90', 'ul. Kirova, d. 123, kv. 45',
        'ul. Pervomajskaya, d. 45, kv. 67', 'ul. CHernova, d. 7, kv. 78', 'ul. Karla Marksa, d. 8, kv. 9', 'ul. Oplesnina, d. 78, kv. 56',
        'ul. Zapadnaya, d. 84, kv. 48', 'ul. Pushkina, d. 1, kv. 23', 'ul. Kirova, d. 5, kv. 8', 'ul. Internacionalnaya, d. 6, kv. 9',
        'ul. Kuratova, d. 7, kv. 9', 'ul. Pushkina, d. 56, kv. 80', 'ul. Zapadnaya, d. 47, kv. 39', 'ul. CHernova, d. 78, kv. 69',
        'ul. CHernova, d. 75, kv. 39', 'ul. Internacionalnaya, d. 70, kv. 84', 'ul. Pervomajskaya, d. 94, kv. 4', 'ul. Pushkina, d. 3, kv. 21',
        'ul. Zapadnaya, d. 4, kv. 2', 'ul. CHernova, d. 8, kv. 5', 'ul. Kuratova, d. 9, kv. 5', 'ul. Zapadnaya, d. 6, kv. 3',
        'ul. CHernova, d. 9, kv. 34', 'ul. Karla Marksa, d. 11, kv. 56', 'ul. Oplesnina, d. 11, kv. 13', 'ul. Pervomajskaya, d. 31, kv. 3',
        'ul. Zapadnaya, d. 22, kv. 33', 'ul. Internacionalnaya, d. 77, kv. 87', 'ul. Kirova, d. 47, kv. 94', 'ul. Kuratova, d. 44, kv. 87',
        'ul. Zapadnaya, d. 101, kv. 92', 'ul. CHernova, d. 197, kv. 56', 'ul. Pervomajskaya, d. 91, kv. 71', 'ul. CHernova, d. 41, kv. 31',
        'ul. Karla Marksa, d. 68, kv. 15', 'ul. Pushkina, d. 5, kv. 13', 'ul. Kuratova, d. 98, kv. 67', 'ul. Zapadnaya, d. 67, kv. 93',
        'ul. Oplesnina, d. 89, kv. 89', 'ul. CHernova, d. 777, kv. 77', 'ul. Internacionalnaya, d. 666, kv. 7', 'ul. Zapadnaya, d. 87, kv. 9',
        'ul. Zapadnaya, d. 7, kv. 19'
    ]
}
data_student_in_class = {
    'id': [67, 68, 69, 57, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83,
           84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100,
           101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114,
           115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128,
           129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
           143, 144, 145, 146, 147, 148, 149, 150],
    'class': [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 8, 8, 8, 8, 8, 8, 8, 8, 8,
              8, 8, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
              6, 5, 5, 5, 5, 5, 5, 5, 5, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3, 3, 3, 3,
              3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1],
    'student': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
                21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38,
                39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56,
                57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74,
                75, 76, 77, 78, 79, 80, 81, 82, 83, 84]
}
data_teacher = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    'first_name': ['Pavel', 'Vasilij', 'Mariya', 'Taisiya', 'Marina', 'Ekaterina', 'Liliya', 
                   'Sofya', 'Viktoriya', 'YUrij', 'Andrej', 'Bogdan', 'Aleksandr', "Vasil'ev", 'Petr'],
    'middle_name': ['Petrovich', 'Antonovich', 'Stepanovna', 'Timurovna', 'Gennadevna', 
                    'YAkovlevna', 'Timurovna', 'Dmitrievna', 'Nikolaevna', None, None, 
                    'Romanovich', 'Vladimirovich', "Vasil'evich", 'Alekseevich'],
    'last_name': ['Romashkin', 'Kolesnikov', 'Vaulina', 'ZHedrinskaya', 'Sosnovskaya', 
                  'Myasoedova', 'Arakcheeva', 'Krauze', 'Ostrozhskaya', 'Krylov', 
                  'Evseev', 'Moiseev', 'Sobolev', "Vasil'ev", 'Romashkin']
}
data_subject = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    'name': ['Math', 'Russian language', 'Literature', 'Physics', 'Chemistry', 
             'Geography', 'History', 'Biology', 'English language', 'Informatics',
             'Physical Culture', 'Robotics', 'Technology']
}
data_timepair = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8],
    'start_pair': ['08:30:00', '09:20:00', '10:15:00', '11:05:00', 
                   '12:50:00', '13:40:00', '14:35:00', '15:25:00'],
    'end_pair': ['09:15:00', '10:05:00', '11:00:00', '11:50:00',
                 '13:35:00', '14:25:00', '15:20:00', '16:10:00']
}

data_timepair['start_pair'] = pd.to_datetime(data_timepair['start_pair'], format='%H:%M:%S')
data_timepair['end_pair'] = pd.to_datetime(data_timepair['end_pair'], format='%H:%M:%S')
data_student['birthday'] = pd.to_datetime(data_student['birthday'])
data_schedule['date'] = pd.to_datetime(data_schedule['date'])
Class = pd.DataFrame(data_class)
Schedule = pd.DataFrame(data_schedule)
Student = pd.DataFrame(data_student)
Student_in_class = pd.DataFrame(data_student_in_class)
Teacher = pd.DataFrame(data_teacher)
Subject = pd.DataFrame(data_subject)
Timepair = pd.DataFrame(data_timepair)

In [6]:
people_like_view_in_sql = pd.concat([
    Teacher[['first_name', 'last_name']].assign(person = 'teacher'),
    Student[['first_name', 'last_name']].assign(person = 'student')
], ignore_index=True)
people_like_view_in_sql

    first_name     last_name   person
0        Pavel     Romashkin  teacher
1      Vasilij    Kolesnikov  teacher
2       Mariya       Vaulina  teacher
3      Taisiya  ZHedrinskaya  teacher
4       Marina   Sosnovskaya  teacher
..         ...           ...      ...
95      Semyon       Voronov  student
96  Innokentij      Nekrasov  student
97      Artyom       Nikitin  student
98        Egor      Belyakov  student
99   Elizaveta       Fadeeva  student

[100 rows x 3 columns]

In [ ]:
shift_30_minutes = Timepair.copy()
shift_30_minutes['start_pair'] = shift_30_minutes['start_pair'] + pd.Timedelta(minutes=30) 
shift_30_minutes['end_pair'] = shift_30_minutes['end_pair'] + pd.Timedelta(minutes=30)
shift_30_minutes

   id          start_pair            end_pair
0   1 1900-01-01 09:00:00 1900-01-01 09:45:00
1   2 1900-01-01 09:50:00 1900-01-01 10:35:00
2   3 1900-01-01 10:45:00 1900-01-01 11:30:00
3   4 1900-01-01 11:35:00 1900-01-01 12:20:00
4   5 1900-01-01 13:20:00 1900-01-01 14:05:00
5   6 1900-01-01 14:10:00 1900-01-01 14:55:00
6   7 1900-01-01 15:05:00 1900-01-01 15:50:00
7   8 1900-01-01 15:55:00 1900-01-01 16:40:00

In [ ]:
teachers_in_each_11th_classes = Schedule.merge(Class, left_on='class', right_on='id')
teachers_in_each_11th_classes = teachers_in_each_11th_classes[teachers_in_each_11th_classes['name'].str.contains('11')][['teacher', 'name']].sort_values(by='teacher')
teachers_in_each_11th_classes = teachers_in_each_11th_classes.groupby('teacher')['name'].unique()
for teacher, name_class in teachers_in_each_11th_classes.items():
    if len(name_class) == 2:
        print(teacher)

2
3
6
8
10
11
13

In [ ]:
sorted_last_name_first_name = Student.copy()
sorted_last_name_first_name['name'] = sorted_last_name_first_name['last_name']+'.'+sorted_last_name_first_name['first_name'].str[0]+'.'
sorted_last_name_first_name['name'].sort_values()

36       Alekseev.I.
40        Avdeeva.Y.
13        Baranov.G.
59    Belozyorova.A.
83       Belyakov.E.
           ...
80        Voronov.S.
35       YAkushev.M.
3         ZHdanov.A.
37       Zaharova.L.
57       Zaharova.N.
Name: name, Length: 85, dtype: object

In [3]:
students_born_in_may = Student[Student['birthday'].dt.month == 5][['last_name', 'first_name', 'birthday']]
students_born_in_may

     last_name first_name                  birthday
7    Voroncova   Angelina 2000-05-21 00:00:00+00:00
15  Bolshakova  Valentina 2001-05-30 00:00:00+00:00
25    Trofimov    Dmitrij 2001-05-06 00:00:00+00:00
38    Sidorova     Polina 2002-05-18 00:00:00+00:00
50    Makarova  Viktoriya 2002-05-03 00:00:00+00:00
62      Markov      YUrij 2003-05-15 00:00:00+00:00
74    Nesterov       Gleb 2004-05-05 00:00:00+00:00
75     Makarov      Denis 2004-05-09 00:00:00+00:00

In [54]:
percent_students_born_in_2000 = Student[Student['birthday'].dt.year == 2000]['id'].count()*100//Student['id'].count()
percent_students_born_in_2000

np.int64(11)

In [ ]:
quantity_students_in_10_A_class = Student_in_class.merge(Class, left_on='class', right_on='id')
quantity_students_in_10_A_class =quantity_students_in_10_A_class[quantity_students_in_10_A_class['name'].str.contains('10 A')]['name'].count()
percent_students_in_10_A_from_all_students = round(quantity_students_in_10_A_class/Student_in_class['id'].count()*100, 4)
percent_students_in_10_A_from_all_students

np.float64(11.9048)

In [48]:
count_students_in_each_class = Class.merge(Student_in_class, left_on='id', right_on='class').groupby('name').size().reset_index(name='count_students').sort_values(by='count_students', ascending=False)
count_students_in_each_class.head()

   name  count_students
2  11 A              13
3  11 B              11
1  10 B              11
0  10 A              10
7   9 B               9

In [40]:
count_pairs_Krauze_30_08_2019 = Schedule.merge(Teacher, left_on='teacher', right_on='id')[['last_name', 'date']]
count_pairs_Krauze_30_08_2019 = count_pairs_Krauze_30_08_2019[(count_pairs_Krauze_30_08_2019['last_name'].str.contains('Krauze')) & (count_pairs_Krauze_30_08_2019['date'].dt.year==2019) & (count_pairs_Krauze_30_08_2019['date'].dt.month==8) & (count_pairs_Krauze_30_08_2019['date'].dt.day==30)]['last_name'].count()
count_pairs_Krauze_30_08_2019

np.int64(3)

In [29]:
class_of_Krauze = Schedule.merge(Teacher, left_on='teacher', right_on='id').merge(Class, left_on='class', right_on='id')
class_of_Krauze = class_of_Krauze[class_of_Krauze['last_name']=='Krauze'][['name']].drop_duplicates()
class_of_Krauze

    name
1   11 A
22  11 B
40  10 A

In [26]:
the_most_common_classrooms = Schedule['classroom'].value_counts().reset_index(name='count')
the_most_common_classrooms = the_most_common_classrooms[the_most_common_classrooms['count']==the_most_common_classrooms['count'].max()][['classroom']]
the_most_common_classrooms

   classroom
0         13
1         53
2         43

In [ ]:
max_age_in_10th_class = Student.merge(Student_in_class, left_on='id', right_on='student').merge(Class, left_on='class', right_on='id')[['first_name', 'middle_name', 'last_name','birthday', 'student', 'name']]
max_age_in_10th_class = max_age_in_10th_class[max_age_in_10th_class['name'].str.startswith('10')]
max_age_in_10th_class['age'] = (pd.Timestamp.now(tz='UTC') - max_age_in_10th_class['birthday']).dt.days//365
max_age_in_10th_class[['age']].max()

age    24
dtype: int64

In [9]:
teachers_of_Physical_Culture = Teacher.merge(Schedule, left_on='id', right_on='teacher').merge(Subject, left_on='subject', right_on='id')
teachers_of_Physical_Culture = teachers_of_Physical_Culture[teachers_of_Physical_Culture['name']=='Physical Culture'][['last_name']].sort_values(by='last_name')
teachers_of_Physical_Culture

   last_name
0  Romashkin
5    Vaulina

In [4]:
duration_from_2nd_to_4th_pair = Timepair[(Timepair['id']>= 2) & (Timepair['id']<=4)]
duration_from_2nd_to_4th_pair = duration_from_2nd_to_4th_pair['end_pair'].max() - duration_from_2nd_to_4th_pair['start_pair'].min()
duration_from_2nd_to_4th_pair

Timedelta('0 days 02:30:00')

In [8]:
another_way_duration_from_2nd_to_4th_pair= Timepair.loc[Timepair['id']==4, 'end_pair'].values[0] - Timepair.loc[Timepair['id']==2, 'start_pair'].iloc[0]
another_way_duration_from_2nd_to_4th_pair

Timedelta('0 days 02:30:00')

In [13]:
fourth_pair_starts = Timepair[Timepair['id']==4]['start_pair'].dt.time
fourth_pair_starts

3    11:05:00
Name: start_pair, dtype: object

In [17]:
subjects_of_Romashkin_P_P = Teacher.merge(Schedule, left_on='id', right_on='teacher').merge(Subject, left_on='subject', right_on='id')[['first_name', 'middle_name', 'last_name', 'name']]
subjects_of_Romashkin_P_P = subjects_of_Romashkin_P_P[(subjects_of_Romashkin_P_P['first_name'].str.startswith('P'))&(subjects_of_Romashkin_P_P['middle_name'].str.startswith('P'))&(subjects_of_Romashkin_P_P['last_name'].str.contains('Romashkin'))]['name'].reset_index(drop=True).to_frame('subjects')
subjects_of_Romashkin_P_P

           subjects
0  Physical Culture
1          Robotics

In [11]:
count_students_in_10th = Class.merge(Student_in_class, left_on='id', right_on='class')
count_students_in_10th =count_students_in_10th[count_students_in_10th['name'].str.contains('10 B')]['name'].value_counts()
count_students_in_10th

name
10 B    11
Name: count, dtype: int64

In [54]:
students_with_name_Anna = Student[Student['first_name'].str.contains('Anna')]['first_name'].value_counts()
students_with_name_Anna

first_name
Anna    2
Name: count, dtype: int64

In [20]:
youngest_student = Student.copy()
youngest_student['age'] = ((pd.Timestamp.now(tz='UTC') - youngest_student['birthday']).dt.days/365.25).astype(int)
youngest_student = youngest_student[['age']].min()
youngest_student

age    17
dtype: int64

In [10]:
student_from_Pushkin_street = Student[Student['address'].str.contains('ul. Pushkina')]
student_from_Pushkin_street.head()

,id,first_name,middle_name,last_name,birthday,address
0,1,Nikolaj,Fedorovich,Sokolov,2000-10-01 00:00:00+00:00,"ul. Pushkina, d. 36, kv. 5"
1,2,Vyacheslav,Evgenevich,Eliseev,2000-11-21 00:00:00+00:00,"ul. Pushkina, d. 40, kv. 7"
2,3,Ivan,Antonovich,Efremov,2000-09-19 00:00:00+00:00,"ul. Pushkina, d. 58, kv. 16"
3,4,Anatolij,Valentinovich,ZHdanov,2007-07-15 00:00:00+00:00,"ul. Pushkina, d. 21, kv. 7"
4,5,Georgij,Dmitrievich,Noskov,2000-03-03 00:00:00+00:00,"ul. Pushkina, d. 45, kv. 65"

In [10]:
class_02_09_2019 = Schedule[Schedule['date'].dt.date == pd.to_datetime('2019-09-02').date()]['classroom'].nunique()
class_02_09_2019

5

In [21]:
count_10_class = Class['name'].str.startswith('10').sum()
count_10_class

np.int64(2)